app/controllers/api/v1/prices_controller.rb

    def index
      @prices = Price.all
---
SELECT "prices".* FROM "prices"